{
    "behavior_label": "Confirmation_Path",
    "thread": [
        {
            "message_id": "msg_01",
            "reply_to_message_id": null,
            "day": 0,
            "time": "14:37",
            "sender": "Your Email Reply Team",
            "recipient": "contact@emeraldplaza.com",
            "cc": [],
            "subject": "Summer Weekend Deal for Teams",
            "body": "Dear Emerald Plaza Team,\n\nWe are writing to inquire about your availability for our \"Summer Weekend Deal for Teams\" campaign.  We are a group of 20 and are interested in booking a weekend stay (Friday-Sunday, July 21st-23rd) at your hotel. We'd appreciate it if you could let us know the availability of your Deluxe Suites, including information on rates and any applicable conference room packages (ideally the 'Grand Ballroom').\n\nThank you for your time and consideration.\n\nSincerely,\nThe [Your Company Name] Team"
        },
        {
            "message_id": "msg_02",
            "reply_to_message_id": "msg_01",
            "day": 0,
            "time": "14:48",
            "sender": "contact@emeraldplaza.com",
            "recipient": "Your Email Reply Team",
            "cc": [
                "manager@emeraldplaza.com"
            ],
            "subject": "Re: Summer Weekend Deal for Teams",
            "body": "Dear [Your Company Name] Team,\n\nThank you for your interest in Emerald Plaza. We do have availability for Deluxe Suites for the weekend of July 21st-23rd. We can accommodate your group of 20 comfortably. \n\nThe Grand Ballroom is also available for your use during this period.  I've attached a detailed quote outlining rates for the suites and conference room package, including any applicable discounts for group bookings.\n\nPlease let me know if you have any questions.\n\nSincerely,\nJohn Smith, Reservations Manager, Emerald Plaza Hotel"
        },
        {
            "message_id": "msg_03",
            "reply_to_message_id": "msg_02",
            "day": 1,
            "time": "10:15",
            "sender": "Your Email Reply Team",
            "recipient": "contact@emeraldplaza.com",
            "cc": [],
            "subject": "Re: Re: Summer Weekend Deal for Teams",
            "body": "Dear John Smith,\n\nThank you for the prompt response and the detailed quote.  We are very pleased with the offer and would like to proceed with the booking. Please let us know the next steps.\n\nSincerely,\nThe [Your Company Name] Team"
        }
    ]
}